Repository: XMaster-Denis/mock-tech-interview-ai
Catalog: MockTechInterviewAI/Resources/*.lproj/Localizable.strings
Languages: de

# menu.settings
source: Settings…
de: Einstellungen…

# main.error_title
source: Error
de: Fehler

# main.interview_active
source: Interview Active
de: Interview aktiv

# main.not_started
source: Not Started
de: Nicht gestartet

# main.topic_label
source: Topic: %@
de: Thema: %@

# main.threshold_short
source: Thr:
de: Schw.:

# main.audio_debug_toggle
source: Toggle audio level debug info
de: Audio-Debug anzeigen

# main.help
source: Help
de: Hilfe

# main.help_hint
source: Get a hint for the current task
de: Einen Hinweis zur aktuellen Aufgabe holen

# main.done
source: Done
de: Fertig

# main.done_hint
source: Submit your solution for review
de: Lösung zur Prüfung senden

# main.understand
source: I Understand
de: Verstanden

# main.understand_hint
source: Confirm you understand the solution
de: Bestätigen, dass du die Lösung verstehst

# main.start_interview
source: Start Interview
de: Interview starten

# main.stop_interview
source: Stop Interview
de: Interview stoppen

# transcript.title
source: Transcript
de: Transkript

# transcript.empty
source: No messages yet
de: Noch keine Nachrichten

# transcript.sending
source: Sending...
de: Senden...

# transcript.send
source: Send
de: Senden

# transcript.you
source: You
de: Du

# transcript.listen
source: Play
de: Anhören

# topics.title
source: Topics
de: Themen

# topics.add
source: Add new topic
de: Neues Thema

# topics.settings
source: Settings
de: Einstellungen

# topics.edit
source: Edit topic
de: Thema bearbeiten

# topics.clear_history
source: Clear interview history
de: Interview-Verlauf löschen

# topics.delete
source: Delete topic
de: Thema löschen

# topic_edit.info
source: Topic Information
de: Themeninfo

# topic_edit.title
source: Title
de: Titel

# topic_edit.description
source: Description
de: Beschreibung

# topic_edit.settings
source: Interview Settings
de: Interview-Einstellungen

# topic_edit.programming_language
source: Programming Language
de: Programmiersprache

# topic_edit.interview_mode
source: Interview Mode
de: Interview-Modus

# topic_edit.developer_level
source: Developer Level
de: Level

# topic_edit.preview
source: Preview
de: Vorschau

# topic_edit.new_title
source: New Topic
de: Neues Thema

# topic_edit.edit_title
source: Edit Topic
de: Thema bearbeiten

# common.cancel
source: Cancel
de: Abbrechen

# common.save
source: Save
de: Speichern

# code_panel.solution
source: Solution
de: Lösung

# code_panel.hint
source: Hint
de: Hinweis

# code_panel.expand
source: Expand
de: Erweitern

# code_panel.collapse
source: Collapse
de: Einklappen

# status.recording
source: Recording...
de: Aufnahme...

# action.speak
source: Speak
de: Sprechen

# status.idle
source: Idle
de: Leerlauf

# status.listening
source: Listening...
de: Hören...

# status.processing
source: Processing...
de: Verarbeitung...

# status.speaking
source: Speaking...
de: Sprechen...

# error.load_topics
source: Failed to load topics: %@
de: Themen konnten nicht geladen werden: %@

# error.add_topic
source: Failed to add topic: %@
de: Thema konnte nicht hinzugefügt werden: %@

# error.update_topic
source: Failed to update topic: %@
de: Thema konnte nicht aktualisiert werden: %@

# error.delete_topic
source: Failed to delete topic: %@
de: Thema konnte nicht gelöscht werden: %@

# error.clear_history_failed
source: Failed to clear interview history
de: Interview-Verlauf konnte nicht gelöscht werden

# error.api_key_required
source: Please configure your OpenAI API key in Settings first
de: Bitte zuerst den OpenAI API Key in den Einstellungen setzen

# error.start_interview_first
source: Please start the interview first
de: Bitte starte zuerst das Interview

# settings.save
source: Save
de: Speichern

# settings.cancel
source: Cancel
de: Abbrechen

# settings.api_key_placeholder
source: Enter your API key
de: API Key eingeben

# settings.api_key_valid
source: API key is valid ✓
de: API Key ist gültig ✓

# settings.api_key_required
source: API key is required - Get one at platform.openai.com
de: API Key erforderlich – erhalte ihn auf platform.openai.com

# settings.interview_language
source: Interview Language
de: Interview-Sprache

# settings.interface_language
source: Interface Language
de: UI-Sprache

# settings.language_label
source: Language
de: Sprache

# settings.ai_models
source: AI Models
de: KI-Modelle

# settings.chat_model
source: Chat Model
de: Chat-Modell

# settings.whisper_model
source: Whisper Model
de: Whisper-Modell

# settings.tts_model
source: TTS Model
de: TTS-Modell

# settings.ai_voice
source: AI Voice
de: KI-Stimme

# settings.voice_label
source: Voice
de: Stimme

# settings.tts_interruption
source: TTS Interruption
de: TTS-Unterbrechung

# settings.tts_interruption_desc
source: Allow microphone noise to interrupt AI speech
de: Mikrofonrauschen darf die KI-Sprachausgabe unterbrechen

# settings.allow_interruption
source: Allow interruption
de: Unterbrechung erlauben

# settings.audio_test_desc
source: Test your microphone to ensure voice recognition works properly
de: Mikrofon testen, um Spracherkennung zu prüfen

# settings.test_microphone
source: Test Microphone (5s)
de: Mikrofon testen (5 s)

# settings.stop
source: Stop
de: Stopp

# settings.clear_logs
source: Clear Logs
de: Logs löschen

# settings.voice_threshold
source: Voice Threshold
de: Sprachschwelle

# settings.voice_threshold_desc
source: Microphone sensitivity for voice detection
de: Mikrofonempfindlichkeit für Spracherkennung

# settings.less_sensitive
source: Less Sensitive
de: Weniger empfindlich

# settings.more_sensitive
source: More Sensitive
de: Empfindlicher

# settings.current_threshold
source: Current threshold:
de: Aktuelle Schwelle:

# settings.very_sensitive
source: Very Sensitive
de: Sehr empfindlich

# settings.sensitive
source: Sensitive
de: Empfindlich

# settings.less_sensitive_label
source: Less Sensitive
de: Weniger empfindlich

# settings.calibrate_noise
source: Calibrate Noise Level (3s)
de: Rauschen kalibrieren (3 s)

# settings.calibrated_threshold
source: Calibrated threshold:
de: Kalibrierte Schwelle:

# settings.applied
source: Applied ✓
de: Angewendet ✓

# settings.silence_timeout
source: Silence Timeout
de: Stille-Timeout

# settings.silence_timeout_desc
source: How long to wait for silence after speech ends before processing
de: Wartezeit nach Sprechende vor Verarbeitung

# settings.current_timeout
source: Current timeout:
de: Aktueller Timeout:

# settings.current_timeout_value
source: %.1f seconds
de: %.1f Sekunden

# settings.quick
source: Quick
de: Schnell

# settings.slow
source: Slow
de: Langsam

# settings.very_slow
source: Very Slow
de: Sehr langsam

# settings.shorter_timeout_warning
source: ⚠️ Shorter timeout = faster but may cut off early speech
de: ⚠️ Kürzer = schneller, kann aber früh abschneiden

# settings.min_speech_level
source: Min Speech Level
de: Min. Sprachpegel

# settings.min_speech_desc
source: Minimum audio level to validate speech (filters quiet noises)
de: Mindest-Audiopegel für gültige Sprache

# settings.less_strict
source: Less Strict
de: Weniger strikt

# settings.more_strict
source: More Strict
de: Strikter

# settings.current_level
source: Current level:
de: Aktueller Pegel:

# settings.very_permissive
source: Very Permissive
de: Sehr tolerant

# settings.permissive
source: Permissive
de: Tolerant

# settings.strict
source: Strict
de: Strikt

# settings.min_speech_tip
source: 💡 Lower values = more sensitive (may catch quiet speech)
de: 💡 Niedriger = empfindlicher (erkennt leise Sprache)

# settings.ready_to_test
source: Ready to test
de: Bereit zum Testen

# settings.testing
source: Testing...
de: Test läuft...

# settings.starting_mic_test
source: 🎙️ Starting microphone test for %d seconds...
de: 🎙️ Mikrofontest für %d Sekunden starten...

# settings.speak_to_test
source: 💡 Speak into your microphone to test voice detection
de: 💡 Sprich ins Mikrofon zum Testen

# settings.audio_level_log
source: 🎚️ Audio level: %@
de: 🎚️ Audiopegel: %@

# settings.stopped
source: Stopped
de: Gestoppt

# settings.test_stopped
source: 🛑 Test stopped
de: 🛑 Test gestoppt

# settings.logs_cleared
source: 🗑️ Logs cleared
de: 🗑️ Logs gelöscht

# interview_mode.questions
source: Questions
de: Fragen

# interview_mode.code_tasks
source: Code Tasks
de: Code-Aufgaben

# interview_mode.questions_desc
source: Standard interview with verbal questions and answers
de: Standardinterview mit Fragen und Antworten

# interview_mode.code_tasks_desc
source: Coding challenges with AI evaluation
de: Coding-Aufgaben mit KI-Bewertung

# interview_mode.hybrid_desc
source: Mixed mode with both questions and coding tasks
de: Gemischter Modus mit Fragen und Aufgaben

# developer_level.junior_desc
source: Basic concepts, fundamental knowledge
de: Grundlagen, Basiswissen

# developer_level.middle_desc
source: Advanced concepts, optimization patterns
de: Fortgeschrittene Konzepte, Optimierung

# developer_level.senior_desc
source: Architecture, system design, best practices
de: Architektur, Systemdesign, Best Practices

# developer_level.team_lead_desc
source: System design, trade-offs, team decisions
de: Systemdesign, Trade-offs, Teamentscheidungen
